#1) მომხმარებელს შემოატანინეთ ოთხი რიცხვი და გამოიტანეთ მათი საშუალო არითმეტიკული.

num1=int(input("shemoitane ricxvi"))
num2=int(input("shemoitane meore ricxvi"))
num3=int(input("shemoitane mesame ricxvi"))
num4=int(input("shemoitane meotxe ricxvi"))
print((num1+num2+num3+num4)/4)

#2) მომხმარებელს შემოატანინეთ სახელი და გვარი, შემდეგ გამოპრინტეთ ტექსტი: „მოგესალმები, [სახელი] [გვარი]

name=input("shemoitane saxeli")
surname=input("shemoitane gvari")
print("mogesalmebi,",name,surname)

#3) მომხმარებელს შემოატანინეთ ორი რიცხვი და გამოიტანეთ მათი სტრინგებად გაერთიანებული ვერსია, რომლის შუაშიც იქნება "😊" ემოჯი.

num1=input("shemoitane ricxvi")
num2=input("shemoitane meore ricxvi")
print(num1+"😊"+num2)
