 
# INTERNAL STYLE:
# Internal სტილი წერია <style> თეგში, რომელიც განთავსებულია <head> თეგში.
# იგი გამოიყენება, როცა გსურთ კონკრეტული HTML გვერდისთვის სტილის განსაზღვრა ერთ ფაილში.

# EXTERNAL STYLE:
#     External სტილი დაწერილია ცალკე CSS ფაილში (მაგ. style.css).
#     HTML ფაილში ის შეერთებულია <link> თეგით, რომელიც ასევე <head> ბლოკში წერია.


# INLINE STYLE:
#     Inline სტილი პირდაპირ ელემენტის (მაგ. <p>) შიგნით style ატრიბუტით იწერება.
#     გამოიყენება მაშინ, როცა კონკრეტული ელემენტის სტილის სწრაფი ცვლილებაა საჭირო