#1) მომხმარებელს შემოატანინეთ სიტყვა ან წინადადება შეინახეთ ის reversed_string შეტრიალებულად ცვლადში და გამოიტანეთ ეს ცვლადი



#2) გამოთვალეთ 0 დან 100ს ჩათვლით ყველა რიცხვის ჯამი და შეინახეთ ის sum ცვლადში



#3) მომხმარებეს შემოატანინეთ სამ ასოიანი სიტყვა, თუ  მან არ შემოიყვანა სამი ასო მაშინ გამოუპრინტეთ რომ მან უნდა შეიყვანოს ზუსტად სამი ასო და გაუშვას პროგრამა თავიდან. როდესაც მომხმარებელი შეიყვანს სამ ასოიან სიტყვას, შეამოწმეთ არის თუ არა ის პალინდრომი და გაოუტანეთ True ან False შესაბამისად

