#1 შექმენით list-ი შემდეგი მნიშვნელობებით: [1,4,3,6,9,11,17,13,26,30], თქვენი დავალებაა გამოტანოთ ლუწი რიცხვების ჯამი და კენტი რიცხვების რაოდენობა








# 2. შექმნით list და ბოლოში ჩაამატეთ ნებისმიერი მნიშვნელობა (append)
nums=[1,122,77,7]
nums.append(True)
print(nums)




## 3. მოცემული list-იდან: [1,2,3,3,4,5] ამოშალეთ ის რიცხვი რომელიც არღვევს თანმიმდევრობას (pop)

nums=[1,2,3,3,4,5]
nums.pop(2)
print(nums)

#4list-ში: [1,2,3,4,6,8,9] ჩაამატეთ ის ციფრები რომელიც არის გამოტოვებული (insert)

res=[1,2,3,4,6,8,9]
res.insert(4,5)
res.insert(6,7)
print(res)