#1) შექმენით პროგრამა, რომელშიც მომხმარებელი შემოიტანს რიცხვს, თქვენ უნდა გამოიტანოთ ამ რიცხვის ყველა გამყოფი (ის რიცხვები რომლებზეც გაყოფისას მომხმარებლის მიერ შემოტანილ რიცხვზე ნაშთი 0-ია)

num=int(input("enter number"))
for i in range(1,num+1 ):
    if num %i==0:
     print(i)

#2) ახსენით რა განსხვავებაა While და for loop-ებს შორის

#for ციკლი--გამოიყენება,როცა ვიცით რამდენჯერ უნდა შესრულდეს მოქმედება მაგალითად range()-ით.
#while ციკლი--მუშაობს იქამდე ,სანამ მოცემული პირობა მართალია როცა არ ვიცით რამდენჯერ გაიმეორებს.
        

#4) რა არის ამ გამოსახულების პასუხი 1=t 0=f:
(1 and 0) or (1 and 1) and (0 or 0)==False




