#1) შექმენით პროგრამა რომელიც მომხმარებელს მოთხოვს რაიმე ტექსტს და შემდეგ რიცხვს. პროგრამამ უნდა გამოიტანოს ამ ტექსტის შესაბამისი ასო რიცსვის მიხედვით

text=input("enter text: ")
num=int(input("enter number"))
for i in range(num):
    print(text)

#2) შექმენით პროგრამა რომელსც 100 დან - 1მდე გამოაქვს რიცხვები.
for i in range(100,1,-1):
    print(i)



#3) შექმენით პროგრამა რომელიც 1-100 მდე გამოაქვს მხოლოდ კენტი რიცხვfor i in range(1,100):

for i in range(1,100):
    if i%2==1:
        print(i)


#4)
for i in range(250,500,10):
    print(i)

    