//1)კომენტარის სახით ახსენით თუ რა არის .length 
// ეს არის სიგრძის ფუნქცია

// 2)let str = "hello";დაბეჭდე რამდენი სიმბოლოა
console.log(str.length)

// 3)შექმენი ცვლადი სამივე keyword ის გამოყენებით,შენი დავალებაა დაბეჭდო სამივე ცვლადში შენახული სიმბოლოების ჯამი(გამოიყენე .length და მათემატიკური ოპერატორი)
let name ="zuka"
var surname="bichoshvili"
const age="teqvsmeti"
console.log(name.length + surname.length + age.length)

// 4)შექმენი ორი ერთში შეინახე სახელი მეორეში გვარი ,შემდეგ მოახდინე კონკატინაცია,გამოიყენე string interoplation და ბოლოს დაბეჭდე ამ მთლიანი სტრინგის სიგრძე


// 5)შექმენი ცვლადი let ის გამოყენებითდა შეინახე შენი სახელი,შემდეგ განაახლე ცვლადის მნიშნველბა და მიანიჭე მას "nika" დაბეჭდე საბოლოო შედეგი

// 6)შექმენი ცვლადი var ის გამოყენებითდა შეინახე შენი სახელი,შემდეგ განაახლე ცვლადის მნიშნველბა და მიანიჭე მას "giorgi" დაბეჭდე საბოლოო შედეგი

// 7)შექმენიც ცვლადი const ის გამოყენებით,შემდეგ შეცვალე მისი მნიშვნელობა ,რატომ არ შეცვალა მნიშვნელობა?

// 8)შექმენი ცვლადი let ის გამოყენებით და შიგნით არაფერი შეინახო,ამის შემდეგ სამჯერ განაახლე ამ ცვლადის მნიშნველობა,დაბეჭდე საბოლოო შედეგი

// 9)შექმენი ცვლადი var ის გამოყენებით და შიგნით არაფერი შეინახო,ამის შემდეგ სამჯერ განაახლე ამ ცვლადის მნიშნველობა,დაბეჭდე საბოლოო შედეგი

// 10)შექმენი ცვლადი სამივე keyword ის გამოყენებით და შიგნით არაფერი შეიანხო,დაბეჭდე თითოეული მათგანი და ნახე რას მოგცემს თითოეული პასუხად