#    text-align: justify ნიშნავს, რომ ტექსტის ყოველი ხაზი
#    ორივე მხარეს მარცხნივ და მარჯვნივ სწორ ხაზში" გამოდის.  
#    ანუ ბრაუზერი ზრდის/ამცირებს სიტყვებს შორის დაშორებას,
#    რომ ტექსტის სიგრძე თანაბრად მოერგოს ორივე მხარეს. 

#   font-family: აქ ბევრ ფონტს ვწერთ იმიტომ რომ თუ პირველი Google Sans Code
#    მომხმარებლის მოწყობილობაზე არ არის ხელმისაწვდომი ან ვერ ჩაიტვირთა, 
#    მაშინ გამოიყენება შემდეგი ჩამონათვალში  

#   fallback fonts  ბრაუზერი გადადის სიაში ქვემოთ იქამდე სანამ ვერ მოძებნის 
#    მუშაობისათვის ხელმისაწვდომ ფონტს.  
#    ბოლოს მითითებულია generic family sans-serif 
#    რაც გარანტიას იძლევა, რომ მაინც გამოყენებული იქნება მსგავსი სტილის ფონტი
